function Product(id, name, shortDescription, description, price, image) {
  const reviews = [];
  const getReviews = () => reviews;
  const addReview = (message) => {
    if (message) reviews.push(message);
  };
  return {
    id,
    name,
    shortDescription,
    description,
    price,
    image,
    getReviews,
    addReview,
  };
}

const productsList = (function Products() {
  const products = [];
  products.push(
    Product(
      "card-1",
      `Тъй рече Заратустра, твърди корици-

      Фридрих Ницше `,
      "Книга за всички и никого",
      `"Великите книги притежават свой живот, който авторът им нито може да измери, нито да предвиди. Те знаят повече от него. Сами творят - те стигат по-далече, отколкото той би могъл. Преобразяват хората и нещата тъй, както той не е желал, макар и да са го желали неведомите глъбини на духа му."
      Хайнрих Ман`,
      29.90,
      "https://www.orangecenter.bg/media/catalog/product/cache/bdc2c78f7e06003a3c29bc34b94b23a8/9/7/9786191781737.jpg"
    )
  );
  products.push(
    Product(
      "card-2",
      ` 
      Красиви истории от Шекспир-
      Едит Несбит  `,
      `Във всичките си пътувания Шекспир винаги се придържа към правия път на човешкия живот`,
      `Не поема по обиколните пътища на чувствата и емоциите. В неговите творби няма почтени разбойници, сантиментални крадци, интересни злодеи и дружелюбни, елегантни авантюристки… няма деликатно заплетени ситуации, в които най-неприятните образи са маскирани за ума посредством привидното очарование на стила и емоциите`,
      17.90,
      "https://www.orangecenter.bg/media/catalog/product/cache/bdc2c78f7e06003a3c29bc34b94b23a8/9/7/9789542846451.jpg"
    )
  );
  products.push(
    Product(
      "card-3",
      `
      Към себе си, твърди корици-
      Марк Аврелий `,
      `Открийте безценните истини на един от най-влиятелните текстове от древния свят`,
      `Към себе си“ не е тежък и абстрактен философски текст. Това е практически наръчник, това са размислите на жив човек – изпълнен с противоречия, търсещ истината, повлиян от своето време.`,
      12.9,
      "https://www.orangecenter.bg/media/catalog/product/cache/bdc2c78f7e06003a3c29bc34b94b23a8/9/7/9786192511364.jpg"
    )
  );
  products.push(
    Product(
      "card-4",
      `
      Бедни хора-
      Фьодор М. Достоевски `,
      `Поредицата „Шедьовър“ представя на българския читател безсмъртни образци на световната литература`,
      `МАТЕРИАЛИ
      В този том, драги читателю, ти предстои среща с романа на Ф. М. Достоевски „Бедни хора“, „Неточка Незванова“ и разказа „Отвратителна история“ – на гениалния руски писател Ф. М. Достоевски, създател на неповторима психологическа дълбочина в творбите си, оказал с творчеството си огромно влияние върху световната литература.`,
      30,
      "https://www.orangecenter.bg/media/catalog/product/cache/bdc2c78f7e06003a3c29bc34b94b23a8/9/7/9789540918235.jpg"
    )
  );
  products.push(
    Product(
      "card-5",
      `
      Първото приключение на Шерлок Холмс. Етюд в аленочервено. Илюстрирано луксозно издание-
      Артър Конан Дойл `,
      `Великата класика на английската криминална литература, с нов прочит, във великолепно илюстриран превод, най-близо до оригинала от 1887 г.`,
      `Една изключително красива книга, много богато илюстрирана от Винсент Малие, който е доста голямо име във френските комикси. Той е съавтор на Les Aquanautes, Le Grand Mort, La Quête de l’oiseau du temps, Ténébreuse… Името на Винсент Малие се свързва с това на Лоизел, авторът на митичния Питър Пан: той рисува „Търсенето на птицата на времето“ и поредицата „Великата смърт“ по сценарий на Лоизел и Джиан. Успоредно с това Винсент Малие редовно излага свои картини и илюстрации в различни галерии по света.`,
      50,
      "https://www.orangecenter.bg/media/catalog/product/cache/bdc2c78f7e06003a3c29bc34b94b23a8/9/7/9786197707151_1.jpg"
    )
  );
  const getProducts = function () {
    return products;
  };
  const getProduct = function (id) {
    for (product of getProducts()) {
      if (product.id === id) return product;
    }
    return -1;
  };
  return { getProducts, getProduct };
})();
